## Plan for org_account/iam_identity_center
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 30 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                        NAME                                         |
|--------|-------------------------------------------------------------------------------------|
| add    | `aws_identitystore_group.notify_dev_access_vpc_clientvpn`                           |
|        | `aws_identitystore_group.notify_dev_admin`                                          |
|        | `aws_identitystore_group.notify_dev_read_only`                                      |
|        | `aws_identitystore_group.notify_production_access_ecs_blazer`                       |
|        | `aws_identitystore_group.notify_production_access_quicksight`                       |
|        | `aws_identitystore_group.notify_production_access_vpc_clientvpn`                    |
|        | `aws_identitystore_group.notify_production_admin`                                   |
|        | `aws_identitystore_group.notify_production_admin_pinpoint`                          |
|        | `aws_identitystore_group.notify_production_admin_s3_website_assets`                 |
|        | `aws_identitystore_group.notify_production_admin_support_center`                    |
|        | `aws_identitystore_group.notify_production_billing`                                 |
|        | `aws_identitystore_group.notify_production_read_only`                               |
|        | `aws_identitystore_group.notify_production_read_only_cloudwatch`                    |
|        | `aws_identitystore_group.notify_staging_access_ecs_blazer`                          |
|        | `aws_identitystore_group.notify_staging_access_vpc_clientvpn`                       |
|        | `aws_identitystore_group.notify_staging_admin`                                      |
|        | `aws_identitystore_group.notify_staging_admin_pinpoint`                             |
|        | `aws_identitystore_group.notify_staging_admin_s3_website_assets`                    |
|        | `aws_identitystore_group.notify_staging_admin_support_center`                       |
|        | `aws_identitystore_group.notify_staging_billing`                                    |
|        | `aws_identitystore_group.notify_staging_read_only`                                  |
|        | `aws_identitystore_group.notify_staging_read_only_cloudwatch`                       |
|        | `aws_ssoadmin_account_assignment.notify[&quot;Notify-Dev-Admin-800095993820&quot;]`           |
|        | `aws_ssoadmin_account_assignment.notify[&quot;Notify-Dev-ReadOnly-800095993820&quot;]`        |
|        | `aws_ssoadmin_account_assignment.notify[&quot;Notify-Production-Admin-296255494825&quot;]`    |
|        | `aws_ssoadmin_account_assignment.notify[&quot;Notify-Production-Billing-296255494825&quot;]`  |
|        | `aws_ssoadmin_account_assignment.notify[&quot;Notify-Production-ReadOnly-296255494825&quot;]` |
|        | `aws_ssoadmin_account_assignment.notify[&quot;Notify-Staging-Admin-239043911459&quot;]`       |
|        | `aws_ssoadmin_account_assignment.notify[&quot;Notify-Staging-Billing-239043911459&quot;]`     |
|        | `aws_ssoadmin_account_assignment.notify[&quot;Notify-Staging-ReadOnly-239043911459&quot;]`    |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_identitystore_group.notify_dev_access_vpc_clientvpn will be created
  + resource "aws_identitystore_group" "notify_dev_access_vpc_clientvpn" {
      + description       = "Grants members access to the Notify Dev Client VPN."
      + display_name      = "Notify-Dev-Access-VPC-ClientVPN"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.notify_dev_admin will be created
  + resource "aws_identitystore_group" "notify_dev_admin" {
      + description       = "Grants members administrator access to the Notify Dev account."
      + display_name      = "Notify-Dev-Admin"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.notify_dev_read_only will be created
  + resource "aws_identitystore_group" "notify_dev_read_only" {
      + description       = "Grants members read-only access to the Notify Dev account."
      + display_name      = "Notify-Dev-ReadOnly"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.notify_production_access_ecs_blazer will be created
  + resource "aws_identitystore_group" "notify_production_access_ecs_blazer" {
      + description       = "Grants members access to the Notify Production account's ECS Blazer task."
      + display_name      = "Notify-Production-Connect-ECS-Blazer"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.notify_production_access_quicksight will be created
  + resource "aws_identitystore_group" "notify_production_access_quicksight" {
      + description       = "Grants members access to the Notify Production account's QuickSight service."
      + display_name      = "Notify-Production-Access-QuickSight"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.notify_production_access_vpc_clientvpn will be created
  + resource "aws_identitystore_group" "notify_production_access_vpc_clientvpn" {
      + description       = "Grants members access to the Notify Production Client VPN."
      + display_name      = "Notify-Production-Access-VPC-ClientVPN"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.notify_production_admin will be created
  + resource "aws_identitystore_group" "notify_production_admin" {
      + description       = "Grants members administrator access to the Notify Production account."
      + display_name      = "Notify-Production-Admin"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.notify_production_admin_pinpoint will be created
  + resource "aws_identitystore_group" "notify_production_admin_pinpoint" {
      + description       = "Grants members administrator access to the Notify Production account's Pinpoint service."
      + display_name      = "Notify-Production-Admin-Pinpoint"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.notify_production_admin_s3_website_assets will be created
  + resource "aws_identitystore_group" "notify_production_admin_s3_website_assets" {
      + description       = "Grants members administrator access to the Notify Production account's S3 website asset upload buckets."
      + display_name      = "Notify-Production-Admin-S3-WebsiteAssets"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.notify_production_admin_support_center will be created
  + resource "aws_identitystore_group" "notify_production_admin_support_center" {
      + description       = "Grants members administrator access to the Notify Production account's Support Center."
      + display_name      = "Notify-Production-Admin-SupporCenter"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.notify_production_billing will be created
  + resource "aws_identitystore_group" "notify_production_billing" {
      + description       = "Grants members billing access to the Notify Production account."
      + display_name      = "Notify-Production-Billing"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.notify_production_read_only will be created
  + resource "aws_identitystore_group" "notify_production_read_only" {
      + description       = "Grants members read-only access to the Notify Production account."
      + display_name      = "Notify-Production-ReadOnly"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.notify_production_read_only_cloudwatch will be created
  + resource "aws_identitystore_group" "notify_production_read_only_cloudwatch" {
      + description       = "Grants members read-only access to the Notify Production account's CloudWatch service."
      + display_name      = "Notify-Production-ReadOnly-CloudWatch"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.notify_staging_access_ecs_blazer will be created
  + resource "aws_identitystore_group" "notify_staging_access_ecs_blazer" {
      + description       = "Grants members access to the Notify Staging account's ECS Blazer task."
      + display_name      = "Notify-Staging-Access-ECS-Blazer"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.notify_staging_access_vpc_clientvpn will be created
  + resource "aws_identitystore_group" "notify_staging_access_vpc_clientvpn" {
      + description       = "Grants members access to the Notify Staging Client VPN."
      + display_name      = "Notify-Staging-Access-VPC-ClientVPN"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.notify_staging_admin will be created
  + resource "aws_identitystore_group" "notify_staging_admin" {
      + description       = "Grants members administrator access to the Notify Staging account."
      + display_name      = "Notify-Staging-Admin"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.notify_staging_admin_pinpoint will be created
  + resource "aws_identitystore_group" "notify_staging_admin_pinpoint" {
      + description       = "Grants members administrator access to the Notify Staging account's Pinpoint service."
      + display_name      = "Notify-Staging-Admin-Pinpoint"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.notify_staging_admin_s3_website_assets will be created
  + resource "aws_identitystore_group" "notify_staging_admin_s3_website_assets" {
      + description       = "Grants members administrator access to the Notify Staging account's S3 website asset upload buckets."
      + display_name      = "Notify-Staging-Admin-S3-WebsiteAssets"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.notify_staging_admin_support_center will be created
  + resource "aws_identitystore_group" "notify_staging_admin_support_center" {
      + description       = "Grants members administrator access to the Notify Staging account's Support Center."
      + display_name      = "Notify-Staging-Admin-SupporCenter"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.notify_staging_billing will be created
  + resource "aws_identitystore_group" "notify_staging_billing" {
      + description       = "Grants members billing access to the Notify Staging account."
      + display_name      = "Notify-Staging-Billing"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.notify_staging_read_only will be created
  + resource "aws_identitystore_group" "notify_staging_read_only" {
      + description       = "Grants members read-only access to the Notify Staging account."
      + display_name      = "Notify-Staging-ReadOnly"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.notify_staging_read_only_cloudwatch will be created
  + resource "aws_identitystore_group" "notify_staging_read_only_cloudwatch" {
      + description       = "Grants members read-only access to the Notify Staging account's CloudWatch service."
      + display_name      = "Notify-Staging-ReadOnly-CloudWatch"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_ssoadmin_account_assignment.notify["Notify-Dev-Admin-800095993820"] will be created
  + resource "aws_ssoadmin_account_assignment" "notify" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-37cc13ae63647ac6"
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "800095993820"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.notify["Notify-Dev-ReadOnly-800095993820"] will be created
  + resource "aws_ssoadmin_account_assignment" "notify" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-6f8897f9e56fb805"
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "800095993820"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.notify["Notify-Production-Admin-296255494825"] will be created
  + resource "aws_ssoadmin_account_assignment" "notify" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-37cc13ae63647ac6"
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "296255494825"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.notify["Notify-Production-Billing-296255494825"] will be created
  + resource "aws_ssoadmin_account_assignment" "notify" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-c8b449ab19badad7"
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "296255494825"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.notify["Notify-Production-ReadOnly-296255494825"] will be created
  + resource "aws_ssoadmin_account_assignment" "notify" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-6f8897f9e56fb805"
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "296255494825"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.notify["Notify-Staging-Admin-239043911459"] will be created
  + resource "aws_ssoadmin_account_assignment" "notify" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-37cc13ae63647ac6"
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "239043911459"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.notify["Notify-Staging-Billing-239043911459"] will be created
  + resource "aws_ssoadmin_account_assignment" "notify" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-c8b449ab19badad7"
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "239043911459"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.notify["Notify-Staging-ReadOnly-239043911459"] will be created
  + resource "aws_ssoadmin_account_assignment" "notify" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-6f8897f9e56fb805"
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "239043911459"
      + target_type        = "AWS_ACCOUNT"
    }

Plan: 30 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
